{
    "data":[
        [
            "Hi !! Our company (Caspar.ai) is looking for interns and full time engineers for multiple positions in following areas: - Hardware - Software - Networks & Systems - ML / AI / Deep Learning - Web development - Deployment and Test Automation - Operations & Customer Support Get an opportunity to work in an early stage (~10 engineers) high-tech startup building a ground breaking product. It is based in Bay Area, WELL FUNDED and already PROFITABLE. Company was founded in 2015 by: 1. Prof. David Cheriton (Cofounder of Arista Networks, First investor in GOOGLE) and 2. Prof. Ashutosh Saxena (Cofounder Zibby, World Technology Award Winner 2015) with 3. Yoky Matsuoka (CTO at NEST) as advisor. Forward your resumes to kunal@caspar.ai Feel free to ping me if you want to chat :)", 1
        ],
        [
            "could use some help building a flawless UI for this app. DM me if interested.",1
        ],
        [
            "Hey All,\r\nThere is currently an interesting opportunity at EA for recent grads or soon to be grads here at EA:\r\nEA is currently looking for a Design Engineer / Prototype in their Customer Experience Innovation Lab, which is part of their customer service group. The core function of the Innovation group is to improve the experience of EAs players.\r\nThe position will primarily focus on building and testing out prototypes of new technologies and their impact on the employee and player experiences and would include both building stuff from the ground, but also implementing, configuring and testing external software.\r\nSample projects that the group has worked on:\r\n- Testing the impact of AI and Chatbots in Customer Service - (Coding in Python/Tensorflow)\r\n- Unified Data dashboard - (Coding in Angular2 / Typescript / NodeJS)\r\n- LED Cubes - (Coding in Squirrel / NodeJS / PHP)\r\nWhat this position is:\r\n- An opportunity to blend coding with research.\r\n- A chance to continuously keep up to date with exciting technologies\r\nWhat this position is not:\r\n- Game development\r\n- 100% coding all the time. There will be non coding tasks as part of the role.\r\nFeel free to reach out to me with any questions about the role.\r\nHere's a link to the job req: https://career4.successfactors.com/sfcareer/jobreqcareer…\r\nThanks,\r\nStephen" , 1
        ],
        [
            "Hey guys! So I have a friend of mine who is working on a charity project. They are trying to make an app that continually updates non-profit volunteer opportunities. It's a bit more complicated than that but that's the super baseline idea of the project. I mean i would love to take it on, however my app-making abilities are trash. It's not a huge time commitment and you'd only have to work on it as an occasional weekend thing. So basically they are trying to take a list of events that are submitted by various charities. If this sounds like something you're interested in, please message Alyssa Ashcraft. Thanks guys!!", 1
        ],
        [
            "Title: Junior Developer\r\nLocation: Remote or Austin\r\nCompany: Amazon \r\nNeeds to be a current UT Austin student. Preferably a junior or senior. We are looking for people graduating in Dec 2017 or later.\r\nProgram Description:\r\nThis program allows students to obtain a paid part-time virtual/remote position with the Software Development Engineers at Amazon in Austin, TX while actively pursuing their coursework. Junior Developers will be paired up with an engineering Mentor in Austin and will coordinate with them on work assignments. There will be a 2 day (lodging paid) orientation in the Amazon Austin office prior to the start of the Semester. The remainder of the work will be completed remotely with Mentors visiting you at school to provide guidance. During summers there is an opportunity to work full time in the Amazon Austin office (lodging paid) alongside Mentors and other engineers. Upon graduation and successful completion of the program there may be an opportunity to work full time at Amazon as a Software Developer Engineer.\r\nBasic Qualification:\r\n· Within 2 years or less of obtaining a Bachelor’s Degree in Computer Science/Computer Engineering at Texas A&M University or University of Texas, Austin.\r\n· Able to work between 12 and 19 total hours per week. A minimum of 3 hours to be worked per shift and a minimum of 6 hours to be worked during M-F which overlap with your mentor’s working hours. (Adjustments to be made for midterms, finals and pre-scheduled time off).\r\n· Proficiency in developing software in at least one object oriented programming language such as Java, C#, C++, or Scala.\r\nPreferred Qualifications:\r\n· Knowledge of developing service oriented architectures and an understanding of design for scalability, performance and reliability.\r\n· Familiarity with the Agile/Scrum software development process.\r\n· Ability to communicate clearly with users, both technical and non-technical, to describe development troubleshooting approaches.\r\n· Eagerness to learn and adopt engineering best practices.\r\n· You must be obsessed with addressing customer needs.\r\n· Your short term career plan is to work in an engineering role upon graduation with a Bachelor’s degree.\r\nCompensation:\r\nPaid Compensation (with opportunity to work on-site in Austin through the summer)\r\nMore Details and Application Link:", 1
        ],
        [
            "I'm curious about our community! Who here is out of state? Out of country? Why did you come to UT? Did you originally come for CS or did life somehow land you here by coinkidink?\r\nLet's hear your story here!",0
        ],
        [
            "I apologize in advance for this post, but I believe the current situation is annoying to more than one person:\r\nThe posts are becoming less and less related to CS... Don't people have facebook friends? I mean, that's the only reason I can think of to justify the fact that they need to post into the CS page to get some attention.... It's sad...\r\nPlease, this is a very cool page that I like to check frequently because, usually, you discover very cool things from the CS world. Try to keep it that way.\r\nThanks", 0
        ],
        [
            "Hey all, I was wondering if there is a 439 class taugh in Python 2.7 🐍 tbh I would really rather not learn C or C# for the class 😣 it sound so boring when I can code up a pretty OS GUI in bootstrap.js", 0
        ],
        [
            "Hi guys, I’m Masha, the VP of New Members in Lambda Alpha Nu, the new co-ed CS fraternity, and I’m here to tell you about that wonderful time of the year.\r\nWhat time is that you ask ?\r\nWell, Lambda Alpha Nu Rush week is starting Monday. You have the opportunity to do cool things like listen to me talk at info sessions and grab some coffee with the actives at Medici before you start your homework due at midnight that night.\r\nNow pay attention because here’s the important stuff like dates and times. \r\nMonday we will have two info sessions at 6pm and 7pm. (http://goo.gl/DSZIW1)\r\nJoin the 2015 Rush group to stay updated (http://goo.gl/KiIBbu) \r\nApplications are released on Monday, we’ll be posting a link to our page and in the rush group so you should also like us. (http://goo.gl/liwx2U)\r\nAnd if you have any questions at all feel free to talk to me, I’m a nice person I promise ~", 0
        ],
        [
            "Hey guys! so I'm wondering if there is anyone in this group looking for a project to put on their resume? it's c++ code that is going to be used for a Grad student who isn't too code savvy . If you're interested in learning more, message Ahmad Al-Rushaidan !!! He's p cool and not intimidating and the project is rather interesting. Thanks guys!\r\nALSO: it's a semi job (aka some money is involved) and it's long term commitment with pay (if that helps)", 0
        ]
    ]
}