{
    "data":[
        [
            "We are looking for *enthusiastic* programmers who have experience in building iOS apps, OR are highly interested in learning iOS development (Swift/Objective-C). We have made progress on our Android version, and we are and will be working with the following APIs/feature-set:\r\n** Calendar API with a custom interface\r\n** Custom Map interface\r\n** Google Places and GeoLocation API\r\nWe are pretty open to new ideas about technology and not married to any interface or API, as long as it helps build/enhance our idea.\r\nOur start up is called Shift Swap and enables low skilled workers to more effectively switch shifts with one another. With much larger ambitions after! We are currently a team of three. Two here in West Campus and the other at Santa Clara U. in the bay area.", 1
        ],
        [
            "Anyone looking for a new opportunity? I have an idea for a startup, and am seeking a partner to handle more of the technical aspects of the project. Experience with mobile app development and Maps API is preferred. If that sounds like something you or someone you know would be interested in, please contact me and we can discuss the details.",1
        ],
        [
            "Hi! Our company is looking for interns and devs who are available part-time or full-time as soon as possible. We provide technical consulting to clients, so projects include mobile and web applications. We are located on 6th street and Congress at WeWork. Here is a small description of the job posting. I can provide more info if you want to email/message me.\r\nLooking for:\r\n- Web developers (Python-Flask/JS-React Stack) \r\n- Web designers \r\n- Front end developers (React)\r\nWhat is it?\r\n- Homies.io is a startup company that builds enterprise-level software solutions for Small-to-Medium Enterprises to help scale their operations to take their business to new heights. We specialize in developing mobile and web applications for enterprises, but also work with startups in bringing their ideas to reality.\r\nExperience:\r\n- Python, Javascript, Swift, or Java \r\n- Knowledge of React framework\r\n- Web development experience\r\n- iOS or Android development experience\r\n- Part time should be able to dedicate 15-20 hours a week.\r\n- Full time should be able to dedicate 30+ hours a week.\r\nPayment:\r\n- Hourly and on contract with bonuses biweekly\r\nJob type:\r\n- Part-time, full-time\r\n- Interns, Entry-Level, Mid-Level, Senior-Level\r\nStart Date:\r\n- available to start anytime\r\nSend resumes to rambo@homies.io" , 1
        ],
        [
            "Looking for an internship for fall? Or perhaps just a way to give back to the community?\r\nCampusWatch is looking for student ambassadors and interns for a variety of positions!\r\nThe Campus Watch team is excited to offer select students the opportunity to help leave a lasting legacy on a school and community we hold near and dear to our hearts. As a company started by UT alumni dedicated to creating a safer environment for our peers, we are looking to add team members who understand the importance of our mission and strive for excellence.\r\nSafety has become a hot topic issue over the years, so, especially after the events of last year, we formulated a plan that could really bring about some change. For more information, check out the attached letter!\r\nThink you have what it takes?\r\nCheck out our website to see what we're about and then send us your resume and a statement of how you believe you can help us and help UT. We may be a fun start up, but we take the safety of our community very seriously. Prepare to create a movement not just a service.\r\nContact:\r\nMasha@CampusWatch.net\r\nCheck us out at!\r\nwww.CampusWatch.net", 1
        ],
        [
            "LOOKING FOR AN EXPERIENCED CODER\r\nHere's an opportunity to experience doing research at UT, I'm working on this public transportation project for the next 3-6 months, it uses a DLL (Dynamic link library) between C++ and CORSIM (transportation software) looking to hire someone to do some coding for us. the requirements is some background on C++ and how DLL works. The hours are really flexible and up to you (work from home) you can do as little as 5 or up to 20 hours a week. your tasks would be to translate some of the commands/goals to code: there's a developers guide as CORSIM uses some special names for its tasks that I can share for you to have an idea on what we work on. Also, looking to hire someone really soon! hit me up with questions! pay is $15/hr", 1
        ],
        [
            "Hey y'all, MongoDB is coming to give a talk at UT Austin next Monday!\r\nLast summer I worked at MongoDB, and it was by far my favorite internship (I plan on returning next summer as well). If you are interested in MongoDB please consider coming to this event!",0
        ],
        [
            "Considering that Brainfreeze almost rarely has actual icecream (mostly just brownies and cookies)\r\nPetition to change the name of the event to Bits, Nibbles and Bytes. (If you think of cooler names, put it down here) and I'll petition the name change!", 0
        ],
        [
            "Has anyone had an issue with all their browsers crashing immediately on the lab machines?", 0
        ],
        [
            "Want to enjoy some Tiff's Treats and learn about open problems that remain at the intersection of geometry and physics of thin objects? Come to the Lecture Series today with Dr. Vouga! It's today from 4-5pm in GDC 2.216.~", 0
        ],
        [
            "aHi everyone!\r\nCS 411 is happening today @ 4:30 pm in GDC 2.506!\r\nCome and listen professors talk about classes they are teaching next semester! Pizza is provided!\r\nLineup:\r\nCS 378 - Cyberphysical Systems - Mok\r\nCS 378 - Concurrency - Rossbach\r\nCS 371P - Object-Oriented Programming - Emran (Downing's TA)\r\nCS 375 - Compilers - Novak\r\nCS 340D - Debugging and Verifying Programs - Hunt\r\nCS 354R - Game Technology - S. Abraham\r\nCS 354T - Game Dev. Capstone - Toprac\r\nCS 378 - Randomized Algorithms - ZuckermanWant to enjoy some Tiff's Treats and learn about open problems that remain at the intersection of geometry and physics of thin objects? Come to the Lecture Series today with Dr. Vouga! It's today from 4-5pm in GDC 2.216.", 0
        ]
    ]
}